[
    {
      "url": "minecraft-pe-1-18-0-20-apk",
      "title": "Minecraft PE 1.18.0.20",
      "description": "Download Minecraft PE 1.18.0.20 with a working Xbox Live: the long-awaited update that completely changes the game! What&#8217;s new in Minecraft 1.18.0.20\n\nDevelopers from Mojang Studios have been working on updating Caves &amp; Cliffs for quite some time. Finally, they can present their players with an almost complete list of innovations. Now everyone can enjoy new caves and mountains. Sculk blocks\n\nFirst of all, it is worth noting the appearance of new blocks in Minecraft 1.18.0.20. They can be found in the Deep Dark biome deep underground. They make a rather strange sound and have a very dark texture.\n\nIt is worth noting that when walking on these blocks, they react to sounds and movements. This can give out the location of the player. In this way, you can make traps with the help of sculk blocks. Stony peaks\n\nWhen traveling around the world of Minecraft 1.18.0.20, the player may notice quite high mountains. Usually, such locations are entirely covered in snow, but now this will not always be the case.\n\nThe fact is that the developers have added a new biome &#8211; Stony Peaks . This means that instead of snow, the user will see a large amount of stone and gravel. They did this to avoid temperature collisions when changing biomes. Render Dragon\n\nAnother equally interesting innovation is the appearance of the Render Dragon graphics engine in Minecraft Bedrock 1.18.0.20. Thus, the player can meet with quite noticeable changes in the graphics of the game. This will make the world around you more pleasing to the eye. Spyglass\n\nOften, when surviving, it becomes necessary to explore a large area around. The goals can be different. For example, a user wants to find a more comfortable place to equip his hideout in Minecraft 1.18.0.20. However, it is almost impossible to see the distance in the game using conventional methods. To do this, you have to travel a lot and spend a lot of your time.\n\nA new object &#8211; a spyglass- can make this task easier. To craft it, you need to use two copper ingots and an amethyst shard. It is worth noting that the spyglass has a unique atmosphere of use. You can see it when playing from a third person.",
      "thumbnail": "thumbnail/preview-mcpedl-1-18-0-20-200x200-c-default.jpg",
      "images": "images/aT-uHJp7vWI?version=3",
      "category": "Download Minecraft PE 1.18",
      "sub": "MCPE 1.18.0.20",
      "version": "MCPE 1.18.0.20",
      "download": "/getfile/596",
      "rating": "0",
      "image1": "images/fotogeneration-800x533-c-default.png",
      "image2": "images/fotowarden-800x533-c-default.png",
      "image3": "images/fotosculk-800x533-c-default.jpg",
      "image4": "images/fotolush-800x533-c-default.png",
      "link1": "<td>1.18.0.20</td>  <td><a class=\"button\" href=\"/getfile/596\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Download</a></td>",
      "link2": "",
      "link3": "",
      "link4": ""
    }
  ]